### <font color=blue>pandas: výběr dat [MSSQL]</font>

In [ ]:
import pyodbc
import pandas as pd

__definice připojení do MSSQL Serveru__

In [ ]:
server = '192.168.1.159'
database = 'test'
username = 'sa'
password = '1987Acbx'
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE ='+database+'; UID='+username+'; PWD='+password+'')

__dotaz do databáze__

In [9]:
query = "SELECT * FROM [test].[dbo].[drinks]"

__načtení dat z databáze do DataFrame__

In [10]:
data = pd.read_sql(query,conn)

__základní zobrazení dat + přejmenování sloupců pomocí DataFrame.columns__

In [11]:
data.columns = ['Stát','Pivo','Lihoviny','Víno','Celkem','Kontinent']
data

            Stát  Pivo  Lihoviny  Víno  Celkem      Kontinent
0    Afghanistan     0         0     0     0.0           Asia
1        Albania    89       132    54     4.9         Europe
2        Algeria    25         0    14     0.7         Africa
3        Andorra   245       138   312    12.4         Europe
4         Angola   217        57    45     5.9         Africa
..           ...   ...       ...   ...     ...            ...
188    Venezuela   333       100     3     7.7  South America
189      Vietnam   111         2     1     2.0           Asia
190        Yemen     6         0     0     0.1           Asia
191       Zambia    32        19     4     2.5         Africa
192     Zimbabwe    64        18     4     4.7         Africa

[193 rows x 6 columns]

__rychlý statistický náhled na zobrazená data__

In [ ]:
data.describe()